app/controllers/billable_periods_controller.rb

SELECT * FROM "billable_periods" WHERE ("billable_periods"."id" = 10)
---
  def run_maintenance
    @this = BillablePeriod.find(params["id"].to_i)