app/controllers/document_generators_controller.rb

SELECT * FROM "invoices" WHERE ("invoices"."id" = 24)
---
  def invoice
    #    format = params[:format]
    id = params[:id]
    @error_message = []

    if @invoice = Invoice.find(id)